ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Defs.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F580_IM
//  C8051F580_IQ
//  C8051F581_IM
//  C8051F581_IQ
//  C8051F582_IM
//  C8051F582_IQ
//  C8051F583_IM
//  C8051F583_IQ
//  C8051F584_IM
//  C8051F584_IQ
//  C8051F585_IM
//  C8051F585_IQ
//  C8051F586_IM
//  C8051F586_IQ
//  C8051F587_IM
//  C8051F587_IQ
//  C8051F588_IM
//  C8051F589_IM
//  C8051F590_IM
//  C8051F591_IM
//  C8051F592_AM

#ifndef SI_C8051F580_DEFS_H
#define SI_C8051F580_DEFS_H

#include <compiler_defs.h>

//-----------------------------------------------------------------------------
// Register Definitions
//-----------------------------------------------------------------------------
SFR (ACC,         0xE0); ///< Accumulator                                 
SFR (ADC0CF,      0xBC); ///< ADC0 Configuration                          
SFR (ADC0CN,      0xE8); ///< ADC0 Control                                
SFR (ADC0GTH,     0xC4); ///< ADC0 Greater-Than High Byte                 
SFR (ADC0GTL,     0xC3); ///< ADC0 Greater-Than Low Byte                  
SFR (ADC0H,       0xBE); ///< ADC0 Data Word High Byte                    
SFR (ADC0L,       0xBD); ///< ADC0 Data Word Low Byte                     
SFR (ADC0LTH,     0xC6); ///< ADC0 Less-Than High Byte                    
SFR (ADC0LTL,     0xC5); ///< ADC0 Less-Than Low Byte                     
SFR (ADC0MX,      0xBB); ///< ADC0 Multiplexer Selection                  
SFR (ADC0TK,      0xBA); ///< ADC0 Burst Mode Track Time                  
SFR (B,           0xF0); ///< B Register                                  
SFR (CAN0BRPE,    0xA1); ///< CAN BRP Extension                           
SFR (CAN0BTH,     0x9B); ///< CAN Bit Timing High                         
SFR (CAN0BTL,     0x9A); ///< CAN Bit Timing Low                          
SFR (CAN0CFG,     0x92); ///< CAN Clock Configuration                     
SFR (CAN0CN,      0xC0); ///< CAN Control                                 
SFR (CAN0ERRH,    0x97); ///< CAN Error Counter High                      
SFR (CAN0ERRL,    0x96); ///< CAN Error Counter Low                       
SFR (CAN0IF1A1H,  0xCB); ///< CAN Interface 1 Arbitration 1 High          
SFR (CAN0IF1A1L,  0xCA); ///< CAN Interface 1 Arbitration 1 Low           
SFR (CAN0IF1A2H,  0xCD); ///< CAN Interface 1 Arbitration 2 High          
SFR (CAN0IF1A2L,  0xCC); ///< CAN Interface 1 Arbitration 2 Low           
SFR (CAN0IF1CMH,  0xC3); ///< CAN Interface 1 Command Mask High           
SFR (CAN0IF1CML,  0xC2); ///< CAN Interface 1 Command Mask Low            
SFR (CAN0IF1CRH,  0xBF); ///< CAN Interface 1 Command Request High        
SFR (CAN0IF1CRL,  0xBE); ///< CAN Interface 1 Command Request Low         
SFR (CAN0IF1DA1H, 0xD5); ///< CAN Interface 1 Data A 1 High               
SFR (CAN0IF1DA1L, 0xD4); ///< CAN Interface 1 Data A 1 Low                
SFR (CAN0IF1DA2H, 0xD7); ///< CAN Interface 1 Data A 2 High               
SFR (CAN0IF1DA2L, 0xD6); ///< CAN Interface 1 Data A 2 Low                
SFR (CAN0IF1DB1H, 0xDB); ///< CAN Interface 1 Data B 1 High               
SFR (CAN0IF1DB1L, 0xDA); ///< CAN Interface 1 Data B 1 Low                
SFR (CAN0IF1DB2H, 0xDD); ///< CAN Interface 1 Data B 2 High               
SFR (CAN0IF1DB2L, 0xDC); ///< CAN Interface 1 Data B 2 Low                
SFR (CAN0IF1M1H,  0xC5); ///< CAN Interface 1 Mask 1 High                 
SFR (CAN0IF1M1L,  0xC4); ///< CAN Interface 1 Mask 1 Low                  
SFR (CAN0IF1M2H,  0xC7); ///< CAN Interface 1 Mask 2 High                 
SFR (CAN0IF1M2L,  0xC6); ///< CAN Interface 1 Mask 2 Low                  
SFR (CAN0IF1MCH,  0xD3); ///< CAN Interface 1 Message Control High        
SFR (CAN0IF1MCL,  0xD2); ///< CAN Interface 1 Message Control Low         
SFR (CAN0IF2A1H,  0xEF); ///< CAN Interface 2 Arbitration 1 High          
SFR (CAN0IF2A1L,  0xEE); ///< CAN Interface 2 Arbitration 1 Low           
SFR (CAN0IF2A2H,  0xF3); ///< CAN Interface 2 Arbitration 2 High          
SFR (CAN0IF2A2L,  0xF2); ///< CAN Interface 2 Arbitration 2 Low           
SFR (CAN0IF2CMH,  0xE3); ///< CAN Interface 2 Command Mask High           
SFR (CAN0IF2CML,  0xE2); ///< CAN Interface 2 Command Mask Low            
SFR (CAN0IF2CRH,  0xDF); ///< CAN Interface 2 Command Request High        
SFR (CAN0IF2CRL,  0xDE); ///< CAN Interface 2 Command Request Low         
SFR (CAN0IF2DA1H, 0xF7); ///< CAN Interface 2 Data A 1 High               
SFR (CAN0IF2DA1L, 0xF6); ///< CAN Interface 2 Data A 1 Low                
SFR (CAN0IF2DA2H, 0xFB); ///< CAN Interface 2 Data A 2 High               
SFR (CAN0IF2DA2L, 0xFA); ///< CAN Interface 2 Data A 2 Low                
SFR (CAN0IF2DB1H, 0xFD); ///< CAN Interface 2 Data B 1 High               
SFR (CAN0IF2DB1L, 0xFC); ///< CAN Interface 2 Data B 1 Low                
SFR (CAN0IF2DB2H, 0xFF); ///< CAN Interface 2 Data B 2 High               
SFR (CAN0IF2DB2L, 0xFE); ///< CAN Interface 2 Data B 2 Low                
SFR (CAN0IF2M1H,  0xEB); ///< CAN Interface 2 Mask 1 High                 
SFR (CAN0IF2M1L,  0xEA); ///< CAN Interface 2 Mask 1 Low                  
SFR (CAN0IF2M2H,  0xED); ///< CAN Interface 2 Mask 2 High                 
SFR (CAN0IF2M2L,  0xEC); ///< CAN Interface 2 Mask 2 Low                  
SFR (CAN0IF2MCH,  0xCF); ///< CAN Interface 2 Message Control High        
SFR (CAN0IF2MCL,  0xCE); ///< CAN Interface 2 Message Control Low         
SFR (CAN0IIDH,    0x9D); ///< CAN Interrupt High                          
SFR (CAN0IIDL,    0x9C); ///< CAN Interrupt Low                           
SFR (CAN0IP1H,    0xAF); ///< CAN Interrupt Pending 1 High                
SFR (CAN0IP1L,    0xAE); ///< CAN Interrupt Pending 1 Low                 
SFR (CAN0IP2H,    0xB3); ///< CAN Interrupt Pending 2 High                
SFR (CAN0IP2L,    0xB2); ///< CAN Interrupt Pending 2 Low                 
SFR (CAN0MV1H,    0xBB); ///< CAN Message Valid 1 High                    
SFR (CAN0MV1L,    0xBA); ///< CAN Message Valid 1 Low                     
SFR (CAN0MV2H,    0xBD); ///< CAN Message Valid 2 High                    
SFR (CAN0MV2L,    0xBC); ///< CAN Message Valid 2 Low                     
SFR (CAN0ND1H,    0xAB); ///< CAN New Data 1 High                         
SFR (CAN0ND1L,    0xAA); ///< CAN New Data 1 Low                          
SFR (CAN0ND2H,    0xAD); ///< CAN New Data 2 High                         
SFR (CAN0ND2L,    0xAC); ///< CAN New Data 2 Low                          
SFR (CAN0STAT,    0x94); ///< CAN Status                                  
SFR (CAN0TR1H,    0xA3); ///< CAN Transmission Request 1 High             
SFR (CAN0TR1L,    0xA2); ///< CAN Transmission Request 1 Low              
SFR (CAN0TR2H,    0xA5); ///< CAN Transmission Request 2 High             
SFR (CAN0TR2L,    0xA4); ///< CAN Transmission Request 2 Low              
SFR (CAN0TST,     0x9E); ///< CAN Test                                    
SFR (CCH0CN,      0xE3); ///< Cache Control                               
SFR (CKCON,       0x8E); ///< Clock Control                               
SFR (CLKMUL,      0x97); ///< Clock Multiplier Control                    
SFR (CLKSEL,      0x8F); ///< Clock Select                                
SFR (CPT0CN,      0x9A); ///< Comparator 0 Control                        
SFR (CPT0MD,      0x9B); ///< Comparator 0 Mode                           
SFR (CPT0MX,      0x9C); ///< Comparator 0 Multiplexer Selection          
SFR (CPT1CN,      0x9D); ///< Comparator 1 Control                        
SFR (CPT1MD,      0x9E); ///< Comparator 1 Mode                           
SFR (CPT1MX,      0x9F); ///< Comparator 1 Multiplexer Selection          
SFR (CPT2CN,      0x9A); ///< Comparator 2 Control                        
SFR (CPT2MD,      0x9B); ///< Comparator 2 Mode                           
SFR (CPT2MX,      0x9C); ///< Comparator 2 Multiplexer Selection          
SFR (DPH,         0x83); ///< Data Pointer High                           
SFR (DPL,         0x82); ///< Data Pointer Low                            
SFR (EIE1,        0xE6); ///< Extended Interrupt Enable 1                 
SFR (EIE2,        0xE7); ///< Extended Interrupt Enable 2                 
SFR (EIP1,        0xF6); ///< Extended Interrupt Priority 1               
SFR (EIP2,        0xF7); ///< Extended Interrupt Priority 2               
SFR (EMI0CF,      0xB2); ///< External Memory Configuration               
SFR (EMI0CN,      0xAA); ///< External Memory Interface Control           
SFR (EMI0TC,      0xAA); ///< External Memory Timing Control              
SFR (FLKEY,       0xB7); ///< Flash Lock and Key                          
SFR (FLSCL,       0xB6); ///< Flash Scale                                 
SFR (IE,          0xA8); ///< Interrupt Enable                            
SFR (IP,          0xB8); ///< Interrupt Priority                          
SFR (IT01CF,      0xE4); ///< INT0/INT1 Configuration                     
SFR (LIN0ADR,     0xD3); ///< LIN0 Indirect Address                       
SFR (LIN0CF,      0xC9); ///< LIN0 Control Mode                           
SFR (LIN0DAT,     0xD2); ///< LIN0 Indirect Data                          
SFR (ONESHOT,     0xBE); ///< Flash Oneshot Period                        
SFR (OSCICN,      0xA1); ///< High Frequency Oscillator Control           
SFR (OSCICRS,     0xA2); ///< High Frequency Oscillator Coarse Calibration
SFR (OSCIFIN,     0x9E); ///< High Frequency Oscillator Fine Calibration  
SFR (OSCXCN,      0x9F); ///< External Oscillator Control                 
SFR (P0,          0x80); ///< Port 0 Pin Latch                            
SFR (P0MASK,      0xF2); ///< Port 0 Mask                                 
SFR (P0MAT,       0xF1); ///< Port 0 Match                                
SFR (P0MDIN,      0xF1); ///< Port 0 Input Mode                           
SFR (P0MDOUT,     0xA4); ///< Port 0 Output Mode                          
SFR (P0SKIP,      0xD4); ///< Port 0 Skip                                 
SFR (P1,          0x90); ///< Port 1 Pin Latch                            
SFR (P1MASK,      0xF4); ///< Port 1 Mask                                 
SFR (P1MAT,       0xF3); ///< Port 1 Match                                
SFR (P1MDIN,      0xF2); ///< Port 1 Input Mode                           
SFR (P1MDOUT,     0xA5); ///< Port 1 Output Mode                          
SFR (P1SKIP,      0xD5); ///< Port 1 Skip                                 
SFR (P2,          0xA0); ///< Port 2 Pin Latch                            
SFR (P2MASK,      0xB2); ///< Port 2 Mask                                 
SFR (P2MAT,       0xB1); ///< Port 2 Match                                
SFR (P2MDIN,      0xF3); ///< Port 2 Input Mode                           
SFR (P2MDOUT,     0xA6); ///< Port 2 Output Mode                          
SFR (P2SKIP,      0xD6); ///< Port 2 Skip                                 
SFR (P3,          0xB0); ///< Port 3 Pin Latch                            
SFR (P3MASK,      0xAF); ///< Port 3 Mask                                 
SFR (P3MAT,       0xAE); ///< Port 3 Match                                
SFR (P3MDIN,      0xF4); ///< Port 3 Input Mode                           
SFR (P3MDOUT,     0xAE); ///< Port 3 Output Mode                          
SFR (P3SKIP,      0xD7); ///< Port 3 Skip                                 
SFR (P4,          0xB5); ///< Port 4 Pin Latch                            
SFR (P4MDOUT,     0xAF); ///< Port 4 Output Mode                          
SFR (PCA0CN,      0xD8); ///< PCA Control                                 
SFR (PCA0CPH0,    0xFC); ///< PCA Channel 0 Capture Module High Byte      
SFR (PCA0CPH1,    0xEA); ///< PCA Channel 1 Capture Module High Byte      
SFR (PCA0CPH2,    0xEC); ///< PCA Channel 2 Capture Module High Byte      
SFR (PCA0CPH3,    0xEE); ///< PCA Channel 3 Capture Module High Byte      
SFR (PCA0CPH4,    0xFE); ///< PCA Channel 4 Capture Module High Byte      
SFR (PCA0CPH5,    0xCF); ///< PCA Channel 5 Capture Module High Byte      
SFR (PCA0CPL0,    0xFB); ///< PCA Channel 0 Capture Module Low Byte       
SFR (PCA0CPL1,    0xE9); ///< PCA Channel 1 Capture Module Low Byte       
SFR (PCA0CPL2,    0xEB); ///< PCA Channel 2 Capture Module Low Byte       
SFR (PCA0CPL3,    0xED); ///< PCA Channel 3 Capture Module Low Byte       
SFR (PCA0CPL4,    0xFD); ///< PCA Channel 4 Capture Module Low Byte       
SFR (PCA0CPL5,    0xCE); ///< PCA Channel 5 Capture Module Low Byte       
SFR (PCA0CPM0,    0xDA); ///< PCA Channel 0 Capture/Compare Mode 0        
SFR (PCA0CPM1,    0xDB); ///< PCA Channel 1 Capture/Compare Mode          
SFR (PCA0CPM2,    0xDC); ///< PCA Channel 2 Capture/Compare Mode          
SFR (PCA0CPM3,    0xDD); ///< PCA Channel 3 Capture/Compare Mode          
SFR (PCA0CPM4,    0xDE); ///< PCA Channel 4 Capture/Compare Mode          
SFR (PCA0CPM5,    0xDF); ///< PCA Channel 5 Capture/Compare Mode          
SFR (PCA0H,       0xFA); ///< PCA Counter/Timer High Byte                 
SFR (PCA0L,       0xF9); ///< PCA Counter/Timer Low Byte                  
SFR (PCA0MD,      0xD9); ///< PCA Mode                                    
SFR (PCA0PWM,     0xD9); ///< PCA PWM Configuration                       
SFR (PCA1CN,      0xD8); ///< PCA Control                                 
SFR (PCA1CPH10,   0xFE); ///< PCA Channel 10 Capture Module High Byte     
SFR (PCA1CPH11,   0xCF); ///< PCA Channel 11 Capture Module High Byte     
SFR (PCA1CPH6,    0xFC); ///< PCA Channel 6 Capture Module High Byte      
SFR (PCA1CPH7,    0xEA); ///< PCA Channel 7 Capture Module High Byte      
SFR (PCA1CPH8,    0xEC); ///< PCA Channel 8 Capture Module High Byte      
SFR (PCA1CPH9,    0xEE); ///< PCA Channel 9 Capture Module High Byte      
SFR (PCA1CPL10,   0xFD); ///< PCA Channel 10 Capture Module Low Byte      
SFR (PCA1CPL11,   0xCE); ///< PCA Channel 11 Capture Module Low Byte      
SFR (PCA1CPL6,    0xFB); ///< PCA Channel 6 Capture Module Low Byte       
SFR (PCA1CPL7,    0xE9); ///< PCA Channel 7 Capture Module Low Byte       
SFR (PCA1CPL8,    0xEB); ///< PCA Channel 8 Capture Module Low Byte       
SFR (PCA1CPL9,    0xED); ///< PCA Channel 9 Capture Module Low Byte       
SFR (PCA1CPM10,   0xDE); ///< PCA Channel 10 Capture/Compare Mode         
SFR (PCA1CPM11,   0xDF); ///< PCA Channel 11 Capture/Compare Mode         
SFR (PCA1CPM6,    0xDA); ///< PCA Channel 6 Capture/Compare Mode          
SFR (PCA1CPM7,    0xDB); ///< PCA Channel 7 Capture/Compare Mode          
SFR (PCA1CPM8,    0xDC); ///< PCA Channel 8 Capture/Compare Mode          
SFR (PCA1CPM9,    0xDD); ///< PCA Channel 9 Capture/Compare Mode          
SFR (PCA1H,       0xFA); ///< PCA Counter/Timer High Byte                 
SFR (PCA1L,       0xF9); ///< PCA Counter/Timer Low Byte                  
SFR (PCA1MD,      0xD9); ///< PCA Mode                                    
SFR (PCA1PWM,     0xDA); ///< PCA PWM Configuration                       
SFR (PCON,        0x87); ///< Power Control                               
SFR (PSBANK,      0xF5); ///< Program Space Bank Select                   
SFR (PSCTL,       0x8F); ///< Program Store Control                       
SFR (PSW,         0xD0); ///< Program Status Word                         
SFR (REF0CN,      0xD1); ///< Voltage Reference Control                   
SFR (REG0CN,      0xC9); ///< Voltage Regulator Control                   
SFR (RSTSRC,      0xEF); ///< Reset Source                                
SFR (SBCON0,      0xAB); ///< UART0 Baud Rate Generator Control           
SFR (SBRLH0,      0xAD); ///< UART0 Baud Rate Generator High Byte         
SFR (SBRLL0,      0xAC); ///< UART0 Baud Rate Generator Low Byte          
SFR (SBUF0,       0x99); ///< UART0 Serial Port Data Buffer               
SFR (SBUF1,       0x99); ///< UART1 Serial Port Data Buffer               
SFR (SCON0,       0x98); ///< UART0 Serial Port Control                   
SFR (SCON1,       0x98); ///< UART1 Serial Port Control                   
SFR (SFRLAST,     0x86); ///< SFR Page Last                               
SFR (SFRNEXT,     0x85); ///< SFR Page Next                               
SFR (SFRPAGE,     0xA7); ///< SFR Page                                    
SFR (SFRPGCN,     0x84); ///< SFR Page Control                            
SFR (SMB0CF,      0xC1); ///< SMBus 0 Configuration                       
SFR (SMB0CN,      0xC0); ///< SMBus 0 Control                             
SFR (SMB0DAT,     0xC2); ///< SMBus 0 Data                                
SFR (SMOD0,       0xA9); ///< UART0 Mode                                  
SFR (SN0,         0xF9); ///< Serial Number Byte 0                        
SFR (SN1,         0xFA); ///< Serial Number Byte 1                        
SFR (SN2,         0xFB); ///< Serial Number Byte 2                        
SFR (SN3,         0xFC); ///< Serial Number Byte 3                        
SFR (SP,          0x81); ///< Stack Pointer                               
SFR (SPI0CFG,     0xA1); ///< SPI0 Configuration                          
SFR (SPI0CKR,     0xA2); ///< SPI0 Clock Rate                             
SFR (SPI0CN,      0xF8); ///< SPI0 Control                                
SFR (SPI0DAT,     0xA3); ///< SPI0 Data                                   
SFR (TCON,        0x88); ///< Timer 0/1 Control                           
SFR (TH0,         0x8C); ///< Timer 0 High Byte                           
SFR (TH1,         0x8D); ///< Timer 1 High Byte                           
SFR (TL0,         0x8A); ///< Timer 0 Low Byte                            
SFR (TL1,         0x8B); ///< Timer 1 Low Byte                            
SFR (TMOD,        0x89); ///< Timer 0/1 Mode                              
SFR (TMR2CN,      0xC8); ///< Timer 2 Control                             
SFR (TMR2H,       0xCD); ///< Timer 2 High Byte                           
SFR (TMR2L,       0xCC); ///< Timer 2 Low Byte                            
SFR (TMR2RLH,     0xCB); ///< Timer 2 Reload High Byte                    
SFR (TMR2RLL,     0xCA); ///< Timer 2 Reload Low Byte                     
SFR (TMR3CN,      0x91); ///< Timer 3 Control                             
SFR (TMR3H,       0x95); ///< Timer 3 High Byte                           
SFR (TMR3L,       0x94); ///< Timer 3 Low Byte                            
SFR (TMR3RLH,     0x93); ///< Timer 3 Reload High Byte                    
SFR (TMR3RLL,     0x92); ///< Timer 3 Reload Low Byte                     
SFR (TMR4CAPH,    0xCB); ///< Timer 4 Reload High Byte                    
SFR (TMR4CAPL,    0xCA); ///< Timer 4 Reload Low Byte                     
SFR (TMR4CF,      0xC9); ///< Timer 4 Config                              
SFR (TMR4CN,      0xC8); ///< Timer 4 Control                             
SFR (TMR4H,       0xCD); ///< Timer 4 High Byte                           
SFR (TMR4L,       0xCC); ///< Timer 4 Low Byte                            
SFR (TMR5CAPH,    0x93); ///< Timer 5 Reload High Byte                    
SFR (TMR5CAPL,    0x92); ///< Timer 5 Reload Low Byte                     
SFR (TMR5CF,      0x96); ///< Timer 5 Config                              
SFR (TMR5CN,      0x91); ///< Timer 5 Control                             
SFR (TMR5H,       0x95); ///< Timer 5 High Byte                           
SFR (TMR5L,       0x94); ///< Timer 5 Low Byte                            
SFR (VDM0CN,      0xFF); ///< VDD Supply Monitor Control                  
SFR (XBR0,        0xE1); ///< Port I/O Crossbar 0                         
SFR (XBR1,        0xE2); ///< Port I/O Crossbar 1                         
SFR (XBR2,        0xC7); ///< Port I/O Crossbar 2                         
SFR (XBR3,        0xC6); ///< Port I/O Crossbar 3                         

