ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Defs.h
//------------------------------------------------------------------------------
// 16-bit Register Definitions (may not work on all compilers)
//------------------------------------------------------------------------------
SFR16 (ADC0GT,     0xC3); ///< ADC0 Greater-Than               
SFR16 (ADC0,       0xBD); ///< ADC0 Data Word                  
SFR16 (ADC0LT,     0xC5); ///< ADC0 Less-Than                  
SFR16 (CAN0BT,     0x9A); ///< CAN Bit Timing                  
SFR16 (CAN0ERR,    0x96); ///< CAN Error Counter               
SFR16 (CAN0IF1A1,  0xCA); ///< CAN Interface 1 Arbitration 1   
SFR16 (CAN0IF1A2,  0xCC); ///< CAN Interface 1 Arbitration 2   
SFR16 (CAN0IF1CM,  0xC2); ///< CAN Interface 1 Command Mask    
SFR16 (CAN0IF1CR,  0xBE); ///< CAN Interface 1 Command Request 
SFR16 (CAN0IF1DA1, 0xD4); ///< CAN Interface 1 Data A 1        
SFR16 (CAN0IF1DA2, 0xD6); ///< CAN Interface 1 Data A 2        
SFR16 (CAN0IF1DB1, 0xDA); ///< CAN Interface 1 Data B 1        
SFR16 (CAN0IF1DB2, 0xDC); ///< CAN Interface 1 Data B 2        
SFR16 (CAN0IF1M1,  0xC4); ///< CAN Interface 1 Mask 1          
SFR16 (CAN0IF1M2,  0xC6); ///< CAN Interface 1 Mask 2          
SFR16 (CAN0IF1MC,  0xD2); ///< CAN Interface 1 Message Control 
SFR16 (CAN0IF2A1,  0xEE); ///< CAN Interface 2 Arbitration 1   
SFR16 (CAN0IF2A2,  0xF2); ///< CAN Interface 2 Arbitration 2   
SFR16 (CAN0IF2CM,  0xE2); ///< CAN Interface 2 Command Mask    
SFR16 (CAN0IF2CR,  0xDE); ///< CAN Interface 2 Command Request 
SFR16 (CAN0IF2DA1, 0xF6); ///< CAN Interface 2 Data A 1        
SFR16 (CAN0IF2DA2, 0xFA); ///< CAN Interface 2 Data A 2        
SFR16 (CAN0IF2DB1, 0xFC); ///< CAN Interface 2 Data B 1        
SFR16 (CAN0IF2DB2, 0xFE); ///< CAN Interface 2 Data B 2        
SFR16 (CAN0IF2M1,  0xEA); ///< CAN Interface 2 Mask 1          
SFR16 (CAN0IF2M2,  0xEC); ///< CAN Interface 2 Mask 2          
SFR16 (CAN0IF2MC,  0xCE); ///< CAN Interface 2 Message Control 
SFR16 (CAN0IID,    0x9C); ///< CAN Interrupt                   
SFR16 (CAN0IP1,    0xAE); ///< CAN Interrupt Pending 1         
SFR16 (CAN0IP2,    0xB2); ///< CAN Interrupt Pending 2         
SFR16 (CAN0MV1,    0xBA); ///< CAN Message Valid 1             
SFR16 (CAN0MV2,    0xBC); ///< CAN Message Valid 2             
SFR16 (CAN0ND1,    0xAA); ///< CAN New Data 1                  
SFR16 (CAN0ND2,    0xAC); ///< CAN New Data 2                  
SFR16 (CAN0TR1,    0xA2); ///< CAN Transmission Request 1      
SFR16 (CAN0TR2,    0xA4); ///< CAN Transmission Request 2      
SFR16 (DP,         0x82); ///< Data Pointer                    
SFR16 (PCA0CP0,    0xFB); ///< PCA Channel 0 Capture Module    
SFR16 (PCA0CP1,    0xE9); ///< PCA Channel 1 Capture Module    
SFR16 (PCA0CP2,    0xEB); ///< PCA Channel 2 Capture Module    
SFR16 (PCA0CP3,    0xED); ///< PCA Channel 3 Capture Module    
SFR16 (PCA0CP4,    0xFD); ///< PCA Channel 4 Capture Module    
SFR16 (PCA0CP5,    0xCE); ///< PCA Channel 5 Capture Module    
SFR16 (PCA0,       0xF9); ///< PCA Counter/Timer               
SFR16 (PCA1CP10,   0xFD); ///< PCA Channel 10 Capture Module   
SFR16 (PCA1CP11,   0xCE); ///< PCA Channel 11 Capture Module   
SFR16 (PCA1CP6,    0xFB); ///< PCA Channel 6 Capture Module    
SFR16 (PCA1CP7,    0xE9); ///< PCA Channel 7 Capture Module    
SFR16 (PCA1CP8,    0xEB); ///< PCA Channel 8 Capture Module    
SFR16 (PCA1CP9,    0xED); ///< PCA Channel 9 Capture Module    
SFR16 (PCA1,       0xF9); ///< PCA Counter/Timer               
SFR16 (SBRL0,      0xAC); ///< UART0 Baud Rate Generator       
SFR16 (TMR2,       0xCC); ///< Timer 2                         
SFR16 (TMR2RL,     0xCA); ///< Timer 2 Reload                  
SFR16 (TMR3,       0x94); ///< Timer 3                         
SFR16 (TMR3RL,     0x92); ///< Timer 3 Reload                  
SFR16 (TMR4CAP,    0xCA); ///< Timer 4 Reload                  
SFR16 (TMR4,       0xCC); ///< Timer 4                         
SFR16 (TMR5CAP,    0x92); ///< Timer 5 Reload                  
SFR16 (TMR5,       0x94); ///< Timer 5                         

//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------
#define ADC0GNA  0x08 ///< ADC0 Adjustable Selectable Gain
#define ADC0GNH  0x04 ///< ADC0 Selectable Gain High      
#define ADC0GNL  0x07 ///< ADC0 Selectable Gain           
#define LIN0CTRL 0x08 ///< LIN0 Control                   
#define LIN0DIV  0x0C ///< LIN0 Divider                   
#define LIN0DT1  0x00 ///< LIN0 Data Byte 1               
#define LIN0DT2  0x01 ///< LIN0 Data Byte 2               
#define LIN0DT3  0x02 ///< LIN0 Data Byte 3               
#define LIN0DT4  0x03 ///< LIN0 Data Byte 4               
#define LIN0DT5  0x04 ///< LIN0 Data Byte 5               
#define LIN0DT6  0x05 ///< LIN0 Data Byte 6               
#define LIN0DT7  0x06 ///< LIN0 Data Byte 7               
#define LIN0DT8  0x07 ///< LIN0 Data Byte 8               
#define LIN0ERR  0x0A ///< LIN0 Error                     
#define LIN0ID   0x0E ///< LIN0 Identifier                
#define LIN0MUL  0x0D ///< LIN0 Multiplier                
#define LIN0SIZE 0x0B ///< LIN0 Size                      
#define LIN0ST   0x09 ///< LIN0 Status                    

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN (ADC0 Control)
#define SFR_ADC0CN 0xE8
SBIT (ADC0CN_ADCM0,  SFR_ADC0CN, 0); ///< Start of Conversion Mode Select Bit 0
SBIT (ADC0CN_ADCM1,  SFR_ADC0CN, 1); ///< Start of Conversion Mode Select Bit 1
SBIT (ADC0CN_ADLJST, SFR_ADC0CN, 2); ///< Justification Select                 
SBIT (ADC0CN_ADWINT, SFR_ADC0CN, 3); ///< Window Compare Interrupt Flag        
SBIT (ADC0CN_ADBUSY, SFR_ADC0CN, 4); ///< ADC Busy                             
SBIT (ADC0CN_ADINT,  SFR_ADC0CN, 5); ///< Conversion Complete Interrupt Flag   
SBIT (ADC0CN_ADBMEN, SFR_ADC0CN, 6); ///< Burst Mode Enable                    
SBIT (ADC0CN_ADEN,   SFR_ADC0CN, 7); ///< ADC Enable                           

// B (B Register)
#define SFR_B 0xF0
SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

