ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Defs.h
// SCON1 (UART1 Serial Port Control)
#define SFR_SCON1 0x98
SBIT (SCON1_RI,    SFR_SCON1, 0); ///< Receive Interrupt Flag             
SBIT (SCON1_TI,    SFR_SCON1, 1); ///< Transmit Interrupt Flag            
SBIT (SCON1_RB8,   SFR_SCON1, 2); ///< Ninth Receive Bit                  
SBIT (SCON1_TB8,   SFR_SCON1, 3); ///< Ninth Transmission Bit             
SBIT (SCON1_REN,   SFR_SCON1, 4); ///< Receive Enable                     
SBIT (SCON1_MCE,   SFR_SCON1, 5); ///< Multiprocessor Communication Enable
SBIT (SCON1_SMODE, SFR_SCON1, 7); ///< Serial Port 0 Operation Mode       

// SMB0CN (SMBus 0 Control)
#define SFR_SMB0CN 0xC0
SBIT (SMB0CN_SI,      SFR_SMB0CN, 0); ///< SMBus Interrupt Flag            
SBIT (SMB0CN_ACK,     SFR_SMB0CN, 1); ///< SMBus Acknowledge               
SBIT (SMB0CN_ARBLOST, SFR_SMB0CN, 2); ///< SMBus Arbitration Lost Indicator
SBIT (SMB0CN_ACKRQ,   SFR_SMB0CN, 3); ///< SMBus Acknowledge Request       
SBIT (SMB0CN_STO,     SFR_SMB0CN, 4); ///< SMBus Stop Flag                 
SBIT (SMB0CN_STA,     SFR_SMB0CN, 5); ///< SMBus Start Flag                
SBIT (SMB0CN_TXMODE,  SFR_SMB0CN, 6); ///< SMBus Transmit Mode Indicator   
SBIT (SMB0CN_MASTER,  SFR_SMB0CN, 7); ///< SMBus Master/Slave Indicator    

// SPI0CN (SPI0 Control)
#define SFR_SPI0CN 0xF8
SBIT (SPI0CN_SPIEN,  SFR_SPI0CN, 0); ///< SPI0 Enable            
SBIT (SPI0CN_TXBMT,  SFR_SPI0CN, 1); ///< Transmit Buffer Empty  
SBIT (SPI0CN_NSSMD0, SFR_SPI0CN, 2); ///< Slave Select Mode Bit 0
SBIT (SPI0CN_NSSMD1, SFR_SPI0CN, 3); ///< Slave Select Mode Bit 1
SBIT (SPI0CN_RXOVRN, SFR_SPI0CN, 4); ///< Receive Overrun Flag   
SBIT (SPI0CN_MODF,   SFR_SPI0CN, 5); ///< Mode Fault Flag        
SBIT (SPI0CN_WCOL,   SFR_SPI0CN, 6); ///< Write Collision Flag   
SBIT (SPI0CN_SPIF,   SFR_SPI0CN, 7); ///< SPI0 Interrupt Flag    

// TCON (Timer 0/1 Control)
#define SFR_TCON 0x88
SBIT (TCON_IT0, SFR_TCON, 0); ///< Interrupt 0 Type Select
SBIT (TCON_IE0, SFR_TCON, 1); ///< External Interrupt 0   
SBIT (TCON_IT1, SFR_TCON, 2); ///< Interrupt 1 Type Select
SBIT (TCON_IE1, SFR_TCON, 3); ///< External Interrupt 1   
SBIT (TCON_TR0, SFR_TCON, 4); ///< Timer 0 Run Control    
SBIT (TCON_TF0, SFR_TCON, 5); ///< Timer 0 Overflow Flag  
SBIT (TCON_TR1, SFR_TCON, 6); ///< Timer 1 Run Control    
SBIT (TCON_TF1, SFR_TCON, 7); ///< Timer 1 Overflow Flag  

// TMR2CN (Timer 2 Control)
#define SFR_TMR2CN 0xC8
SBIT (TMR2CN_T2XCLK,  SFR_TMR2CN, 0); ///< Timer 2 External Clock Select    
SBIT (TMR2CN_TR2,     SFR_TMR2CN, 2); ///< Timer 2 Run Control              
SBIT (TMR2CN_T2SPLIT, SFR_TMR2CN, 3); ///< Timer 2 Split Mode Enable        
SBIT (TMR2CN_TF2CEN,  SFR_TMR2CN, 4); ///< Timer 2 Capture Enable           
SBIT (TMR2CN_TF2LEN,  SFR_TMR2CN, 5); ///< Timer 2 Low Byte Interrupt Enable
SBIT (TMR2CN_TF2L,    SFR_TMR2CN, 6); ///< Timer 2 Low Byte Overflow Flag   
SBIT (TMR2CN_TF2H,    SFR_TMR2CN, 7); ///< Timer 2 High Byte Overflow Flag  

// TMR4CN (Timer 4 Control)
#define SFR_TMR4CN 0xC8
SBIT (TMR4CN_CPRL4, SFR_TMR4CN, 0); ///< Capture / Reload Select           
SBIT (TMR4CN_CT4,   SFR_TMR4CN, 1); ///< Counter / Timer Select            
SBIT (TMR4CN_TR4,   SFR_TMR4CN, 2); ///< Timer 4 Run Control               
SBIT (TMR4CN_EXE4,  SFR_TMR4CN, 3); ///< Timer 4 External Enable           
SBIT (TMR4CN_EXF4,  SFR_TMR4CN, 6); ///< Timer 4 External Flag             
SBIT (TMR4CN_TF4,   SFR_TMR4CN, 7); ///< Timer 4 Overflow or Underflow Flag

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn    0  ///< External Interrupt 0     
#define TIMER0_IRQn  1  ///< Timer 0 Overflow         
#define INT1_IRQn    2  ///< External Interrupt 1     
#define TIMER1_IRQn  3  ///< Timer 1 Overflow         
#define UART0_IRQn   4  ///< UART 0                   
#define TIMER2_IRQn  5  ///< Timer 2 Overflow         
#define SPI0_IRQn    6  ///< SPI0                     
#define SMBUS0_IRQn  7  ///< SMBus 0                  
#define ADC0WC_IRQn  8  ///< ADC0 Window Compare      
#define ADC0EOC_IRQn 9  ///< ADC0 End of Conversion   
#define PCA0_IRQn    10 ///< PCA0                     
#define CMP0_IRQn    11 ///< Comparator 0             
#define CMP1_IRQn    12 ///< Comparator 1             
#define TIMER3_IRQn  13 ///< Timer 3 Overflow         
#define LIN0_IRQn    14 ///< LIN0                     
#define VREG0_IRQn   15 ///< Voltage Regulator Dropout
#define CAN0_IRQn    16 ///< CAN0                     
#define PMATCH_IRQn  17 ///< Port Match               
#define UART1_IRQn   18 ///< UART 1                   
#define PCA1_IRQn    19 ///< PCA1                     
#define CMP2_IRQn    20 ///< Comparator 2             
#define TIMER4_IRQn  21 ///< Timer 4 Overflow         
#define TIMER5_IRQn  22 ///< Timer 5 Overflow         

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define ACTIVE1_PAGE 0x00 ///< Active SFR Page 1                 
#define LEGACY_PAGE  0x00 ///< Legacy SFR Page                   
#define CAN0_PAGE    0x0C ///< CAN0 Page                         
#define CONFIG_PAGE  0x0F ///< System and Port Configuration Page
#define ACTIVE2_PAGE 0x10 ///< Active SFR Page 2                 

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------

#if defined SDCC

SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_C8051F580_DEFS_H
//-eof--------------------------------------------------------------------------

